<h2>個人情報保護方針</h2>
<p>LOVE ME渋谷本店(以下「当店」といいます)は、お客様に安全で快適なエステティックサービスを提供するにあたり「個人情報の保護に関する法律」他、関係諸法令を遵守し、お客様の個人情報保護の徹底に努めます。</p>

<section>
    <h3>【1】 法令、規範の遵守について</h3>
    <p>個人情報保護規定その他諸規定を定め、これを遵守し、みなさまの個人情報を適正に管理します。</p>
</section>
<section>
    <h3>【2】 個人情報の収集、利用、提供について</h3>
    <p>ご提供いただいた個人情報は、法に基づく開示請求など特段の事情がある場合を除き、事前にお客様の同意なく、利用目的を超えて利用することはありません。<br>弊社が取得したお客様の個人情報は、弊社が管理し、顧客管理並びに弊社及び提携会社の美容に関するＤＭの送付、関連するアフターサービス、新商品·サービス情報のお知らせのために利用いたします。</p>
</section>
<section>
    <h3>【3】個人情報の管理について</h3>
    <p>ご提供いただいた個人情報は、法に基づく開示請求など特段事情がある場合などを除き、事前にお客様の同意なく、第三者に提供することはありません。</p>
</section>
<section>
    <h3>【4】個人情報の外部委託について</h3>
    <p>個人情報の処理(外部に委託する場合も含む)に関し、適正かつ安全な管理が図られるよう、取扱者に対して、必要かつ適切な監督を行います。</p>
</section>
<section>
    <h3>【5】個人情報の開示・訂正等の請求への対応について</h3>
    <p>ご提供いただいた個人情報に関し、内容の開示や訂正、利用停止等のお申し出があった場合は、.法に定める場合を除き、ご本人確認等必要な手続きの上、速やかに対処いたします。</p>
</section>
<section>
    <h3>【6】 個人情報のお問合せ等の対応について</h3>
    <p>個人情報の取扱に関するご要望、苦情に対し、適切かつ迅速な対応に努めます。</p>
</section>
<section>
    <h3>【7】 個人情報保護体制の見直しと改善について</h3>
    <p>上記各項の内容は業務に係る人材に教育を徹底し、継続的に見直し、改善に努めてまいります。</p>
</section>