<?php
//======================================================================
// 葬儀情報の設定
//======================================================================
class appConfigFuneral
{
    public const plan = [
        'unknown' => '未定',
        'plan1' => '直葬',
        'plan2' => '火葬',
        'plan3' => '一日葬',
        'plan4' => '家族葬',
        'plan5' => '一般葬'
    ];

    const enshrined =  [
        'none' => '未定',
        'home' => '自宅安置',
        'storage' => 'お預かり安置',
        'stay' => '付添い安置'
    ];
}
