<?php
//======================================================================
// WEBサイトの設定
//======================================================================
class appConfigSite
{
  //======================================================================
  // メンテナンスモード
  //======================================================================
  public const maintenance = false;
  //======================================================================
  // サイト基本情報
  //======================================================================
  public const siteName = 'TP_スタッフ管理画面';
  public const website = "https://tomin-osohshiki.jp/";
  public const tel = "03-6419-2012";
  public const update = "202505021830";
  //======================================================================
  // サイト内で使用するID
  //======================================================================
  const pageHeader = '#page-header'; //ヘッダーのID
  const pageMain = '#page-main'; //メインコンテンツのID
  const spinners = '#spinners';
  const secCsIndex = '#cs-index'; //対応ログ一覧
  const secCsEdit = '#form-edit'; //対応ログ入力フォーム
  const secSearch = '#form-search'; //対応ログ検索フォーム
  //======================================================================
  // サイト内で使用するdata属性（除：bootStrap）
  //======================================================================
  const cache = false; //キャッシュ保存の有無
}
