<?php
//======================================================================
// 計算処理
//======================================================================
class appFuncCalc
{
    //-----------------------------------------------------
    // 関数：foreachで回したカウントを閲覧者用に最適化
    //-----------------------------------------------------
    public static function foreachCount(int $index): int
    {
        return $index += 1;
    }
    //-----------------------------------------------------
    // 関数：DBから取得したPRIMARY IDを基にIDを生成
    //-----------------------------------------------------
    public static function newPrimaryIndex(int $index): int
    {
        return $index += 1;
    }
}
